app/controllers/pedalboard_pedals_controller.rb

SELECT "pedals".* FROM "pedals"
SELECT "pedalboard_pedals".* FROM "pedalboard_pedals"
---
    def index
        pedalboard_pedals = PedalboardPedal.all

SELECT "pedals".* FROM "pedals" WHERE "pedals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_pedalboard_pedal
        PedalboardPedal.find(params[:id])