app/controllers/pedalboards_controller.rb

SELECT "pedalboards".* FROM "pedalboards"
---
    def index
        pedalboards = Pedalboard.all

INSERT INTO "pedalboards" ("name", "stereo", "pedal_order", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Delays for Gays "], ["stereo", false], ["pedal_order", "{}"], ["user_id", 2], ["created_at", "2021-08-25 21:31:04.227279"], ["updated_at", "2021-08-25 21:31:04.227279"]]
---
    def create
        pedalboard = Pedalboard.create(pedalboard_params)

DELETE FROM "pedalboards" WHERE "pedalboards"."id" = $1  [["id", 4]]
---
    def destroy
        pedalboard = find_pedalboard
        pedalboard.destroy

SELECT "pedalboards".* FROM "pedalboards" WHERE "pedalboards"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def find_pedalboard
        Pedalboard.find(params[:id])